In [1]:
import numpy as np
import pandas as pd

In [2]:
# Series是一维带标签的数组，数组里可以放任意的数据（整数、浮点数、字符串、object），其基本的创建函数是：
# pd.Series(data,index=index)
# 其中index是一个列表，用来作为数组的标签，data可以是不同的数据类型

s = pd.Series(np.random.randn(5),index=list('abcde'))

In [3]:
s

a   -0.076140
b   -0.208384
c    0.140218
d    1.699807
e    0.157208
dtype: float64

In [4]:
s.index

Index([u'a', u'b', u'c', u'd', u'e'], dtype='object')

In [6]:
d = {'a':1 ,'b':2,'d':4}
s = pd.Series(d,index=list('abcd'))
s

a    1.0
b    2.0
c    NaN
d    4.0
dtype: float64

In [7]:
s = pd.Series(np.random.randn(5))

In [8]:
s

0    0.055383
1    0.350046
2   -1.491491
3   -1.342938
4   -0.175676
dtype: float64

In [11]:
s[0]

0.055383316413582566

In [12]:
s[1:4]

1    0.350046
2   -1.491491
3   -1.342938
dtype: float64

In [14]:
s[[1,3,5]]

1    0.350046
3   -1.342938
5         NaN
dtype: float64

In [15]:
np.sin(s)

0    0.055355
1    0.342941
2   -0.996857
3   -0.974152
4   -0.174774
dtype: float64

In [16]:
# 指数e
np.exp(s)

0    1.056946
1    1.419133
2    0.225037
3    0.261078
4    0.838890
dtype: float64

In [17]:
s = pd.Series(np.random.randn(5),index=list('ABCDE'))
s

A   -0.169377
B    0.474739
C    0.863208
D    0.218551
E   -0.022923
dtype: float64

In [18]:
s['A']

-0.16937726761400199

In [19]:
s['g'] = 100
s

A     -0.169377
B      0.474739
C      0.863208
D      0.218551
E     -0.022923
g    100.000000
dtype: float64

In [20]:
＃　获取ｈ，没有就默认为１１
s.get('h', 11)

11

In [26]:
a = pd.Series(np.random.randn(3),index=list('abe'))
b = pd.Series(np.random.randn(3),index=list('bca'))
print '{0}\n\n{1}'.format(a,b)

a   -0.558348
b   -0.978074
e    0.574819
dtype: float64

b   -0.221170
c   -0.608644
a    0.029134
dtype: float64

In [27]:
# 相加会自动标签对其,e和c没有对应的就为NaN
a+b

a   -0.529214
b   -1.199244
c         NaN
e         NaN
dtype: float64

In [29]:
# DataFrame是一个二维带标签的数组：创建的基本格式是DataFrame(data,index=index,columns=columns)
d = {'one': pd.Series([1,2,3,4],index=list('abce')),
     'two': pd.Series([1,2,3],index=list('abc'))}
data = pd.DataFrame(d)
data

   one  two
a    1  1.0
b    2  2.0
c    3  3.0
e    4  NaN

In [30]:
data = pd.DataFrame(d,index=list('acd'))

In [31]:
data

   one  two
a  1.0  1.0
c  3.0  3.0
d  NaN  NaN

In [32]:
data = pd.DataFrame(d,columns=['two','three'])
data

   two three
a    1   NaN
b    2   NaN
c    3   NaN

In [42]:
s = pd.Series(np.random.randn(5),index=list('abcde'))
data = pd.DataFrame(s,columns=['A'])
data

          A
a -0.652297
b  0.309848
c -0.489502
d  0.581414
e -0.810565

In [44]:
# 第十课
df = pd.DataFrame(np.random.randn(6,4),columns=['one','two','three','four'])
df

        one       two     three      four
0  0.995522 -1.211934 -1.276284  0.510763
1 -0.903707 -1.696931  0.005876  1.546941
2 -0.156445 -0.232231  0.525866 -0.640438
3 -0.297427  1.156389  0.832636  1.507648
4 -0.489394 -0.143188 -0.069373 -0.186781
5  0.825006 -0.679074 -0.783760 -1.268338

In [49]:
df.iloc[:1]

        one       two     three      four
0  0.995522 -1.211934 -1.276284  0.510763

In [50]:
df.loc[1]

one     -0.903707
two     -1.696931
three    0.005876
four     1.546941
Name: 1, dtype: float64

In [51]:
df.iloc[2:3]

        one       two     three      four
2 -0.156445 -0.232231  0.525866 -0.640438

In [52]:
df['three']

0   -1.276284
1    0.005876
2    0.525866
3    0.832636
4   -0.069373
5   -0.783760
Name: three, dtype: float64

In [57]:
df.iloc[:,2:3] = df.iloc[:,:1] + df.iloc[:,1:2]
df.iloc[:,:1]

        one
0  0.995522
1 -0.903707
2 -0.156445
3 -0.297427
4 -0.489394
5  0.825006

In [58]:
df.iloc[:,1:2]

        two
0 -1.211934
1 -1.696931
2 -0.232231
3  1.156389
4 -0.143188
5 -0.679074

In [59]:
df.iloc[:,2:3]

   three
0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN

In [60]:
df.iloc[:,2:3] = df.iloc[:,:1] + df.iloc[:,1:2]

In [61]:
df

        one       two  three      four
0  0.995522 -1.211934    NaN  0.510763
1 -0.903707 -1.696931    NaN  1.546941
2 -0.156445 -0.232231    NaN -0.640438
3 -0.297427  1.156389    NaN  1.507648
4 -0.489394 -0.143188    NaN -0.186781
5  0.825006 -0.679074    NaN -1.268338

In [65]:
df['three'] = df['one'] + df['two']

In [66]:
df

        one       two     three      four
0  0.995522 -1.211934 -0.216412  0.510763
1 -0.903707 -1.696931 -2.600638  1.546941
2 -0.156445 -0.232231 -0.388676 -0.640438
3 -0.297427  1.156389  0.858962  1.507648
4 -0.489394 -0.143188 -0.632582 -0.186781
5  0.825006 -0.679074  0.145931 -1.268338

In [67]:
df.loc[1]

one     -0.903707
two     -1.696931
three   -2.600638
four     1.546941
Name: 1, dtype: float64

In [71]:
del df['three']

In [72]:
df

        one       two      four
0  0.995522 -1.211934  0.510763
1 -0.903707 -1.696931  1.546941
2 -0.156445 -0.232231 -0.640438
3 -0.297427  1.156389  1.507648
4 -0.489394 -0.143188 -0.186781
5  0.825006 -0.679074 -1.268338

In [76]:
df.loc[0]

one     0.995522
two    -1.211934
four    0.510763
Name: 0, dtype: float64

In [78]:
df.pop('one')

0    0.995522
1   -0.903707
2   -0.156445
3   -0.297427
4   -0.489394
5    0.825006
Name: one, dtype: float64

In [79]:
df

        two      four
0 -1.211934  0.510763
1 -1.696931  1.546941
2 -0.232231 -0.640438
3  1.156389  1.507648
4 -0.143188 -0.186781
5 -0.679074 -1.268338

In [80]:
# insert插件一列，直接在原数组中操作
df.insert(1,'tt',df['two']+df['four'])
df

        two        tt      four
0 -1.211934 -0.701171  0.510763
1 -1.696931 -0.149990  1.546941
2 -0.232231 -0.872669 -0.640438
3  1.156389  2.664037  1.507648
4 -0.143188 -0.329969 -0.186781
5 -0.679074 -1.947413 -1.268338

In [81]:
# assign复制新的数组，插入
df.assign(kk=df['tt']/df['four'])

        two        tt      four        kk
0 -1.211934 -0.701171  0.510763 -1.372790
1 -1.696931 -0.149990  1.546941 -0.096959
2 -0.232231 -0.872669 -0.640438  1.362613
3  1.156389  2.664037  1.507648  1.767015
4 -0.143188 -0.329969 -0.186781  1.766609
5 -0.679074 -1.947413 -1.268338  1.535405

In [83]:
# assign可以进行函数操作,和链式操作
df.assign(tk=lambda x: x['two']-x['tt']).assign(tf=lambda x: x['four']*x['tk'])

        two        tt      four        tk        tf
0 -1.211934 -0.701171  0.510763 -0.510763 -0.260879
1 -1.696931 -0.149990  1.546941 -1.546941 -2.393026
2 -0.232231 -0.872669 -0.640438  0.640438 -0.410160
3  1.156389  2.664037  1.507648 -1.507648 -2.273001
4 -0.143188 -0.329969 -0.186781  0.186781 -0.034887
5 -0.679074 -1.947413 -1.268338  1.268338 -1.608682

In [84]:
df = pd.DataFrame(np.random.randint(1,10,(6,4)),index=list('abcdef'),columns=list('ABCD'))
df

   A  B  C  D
a  5  9  4  5
b  2  4  4  1
c  2  9  8  7
d  1  6  7  1
e  9  2  4  2
f  9  1  7  7

In [85]:
df.A

a    5
b    2
c    2
d    1
e    9
f    9
Name: A, dtype: int32

In [86]:
df.loc['a']

A    5
B    9
C    4
D    5
Name: a, dtype: int32

In [89]:
df.iloc[1]

A    2
B    4
C    4
D    1
Name: b, dtype: int32

In [91]:
df.values

array([[5, 9, 4, 5],
       [2, 4, 4, 1],
       [2, 9, 8, 7],
       [1, 6, 7, 1],
       [9, 2, 4, 2],
       [9, 1, 7, 7]])

In [92]:
# DataFrame和array相互转化
np.asarray(df)

array([[5, 9, 4, 5],
       [2, 4, 4, 1],
       [2, 9, 8, 7],
       [1, 6, 7, 1],
       [9, 2, 4, 2],
       [9, 1, 7, 7]])